//. JavaScript деген эмне?
// JavaScript // 1 — веб-баракчаларды интерактивдүү кылуучу программалоо тили.7КҮНДӨ ТУЗҮЛГӨН
// HTML — скелет (структура), CSS — кийим (дизайн), JS — жан (логика, аракет).
// Мисалы: браузерде баскычка терезе чыгуу, форманы текшерүү, слайдер, анимация.
// JS браузерде иштейт (Chrome, Firefox), ошондой эле сервер жагында да (Node.js).

// 2. JS кайда жазабыз?
// Үч жол бар:
// 1 Браузердин консолунда (тез тест үчүн)
// 2 HTML файлынын ичинде

// <script> 3 түрү бар бир тырмакча ``, "",Бир тырмакча — 'Hello'
// Кош тырмакча — "Hello"
// Үч тырмакча — '''Hello''' же """Hello"""
//     console.log("Салам, дүйнө!");
// </script>

//  Өзүнчө .js файлда (эң туура жол)
// <script src="script.js"></script> -->

// 3. console.log() — биздин негизги курал
// Дайыма код жазганда console.log() менен текшерип туруу керек — бул "отладка" (debugging).

// 5. Маалымат түрлөрү (Data Types): 8

// string (text) Бир тырмакча — 'Hello'
// Кош тырмакча — "Hello"
// Үч тырмакча — '''Hello''' же """Hello"""
// любой маалымат кавычкага алынып жазылза бул маалымат болуп болуп эсептелинет
// number (567567) сан 
// bigint (789788977978e...) өтө чоң мандар 
// boolean (true, false) эки гана маани 
// undefined (белгисиз) маани бериле элек
// null (бош) маани
// symbor уникалдуу маани үүзү үчүн колдонулат
// object — ссылочный-бир нерсеге тиешелүү болгон маалымат,обьукт болуп саналат

//JavaScript'те маалымат түрлөрү экиге бөлүнөт:
// Primitive (жөнөкөй) — string, number, boolean, undefined, null, bigint, symbol.
// Non-primitive (татаал) — object (объект, массив, функция).

// let herName = "Asan"
// let hisName = "Asan"

// console.log(herName == hisName);

// let herInfo = {
//     name: "Asan",
//     age: 20
// }

// let herInfo = {
//     name: "Asan",
//     age: 20
// }

// 4. Өзгөрмөлөр (variables): let, conts,var-өзгөрмөдөздү жарилоочу  ачык өздөр
// Тез текшерүү: коддун тибин ттекшерет

//let-маанисин өзгөрсө болот
// conts- башка маани берүүгө болбойт
// var-  өзгөрмө жариялоонун эски ыкмасы

//биз varды көп колдонбойбуз көбүгчөсүн let көбүрөөк колдонулат
// 6. Негизги операторлор — арифметикалык операторлор

// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите в консоль фразу 'Привет, Мир!'.

// 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.
// let name = "Cholpon";
// console.log(`Привет, ${name}`);

// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.
// let age = "17";
// console.log(`Возраст, ${age}`);
// 5. Вам даны четыре переменные.
// Первая - для хранения количества дней. Присвойте ей значение "365".
// Вторая - для хранения названия нашей планеты "Земля".
// Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
// Четвертая - для хранения слова "Солнце".
// Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
// "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет примерно 7 млрд. человек."
// let day = "365";
// let planet = "Земля";
// let bigint = "7 млрд";
// let sun = "Солнце";
// console.log(`В нашем году ${day} дней,днем у нас светит ${sun}
// насиление планеты ${planet} составляет примерно ${bigint} человек.`);
// let age = "17";
// let citi = "Bihkeke";
// console.log(`мне ${age} лет,я живу в  ${citi} и изучаю javascript`);
// let name = "aidana";
// console.log(name);
// let age = "18";
// console.log(`Возрасе ${age}`);
// let citi = "Mockow";
// let country = "Possia";
// console.log(`Я жыву в ${citi} страна ${country}`);
// let anumal ="кошка";
// let color = "белая";
// let number = "4";
// let string ="рыба";
// console.log(`Моя ${anumal} ${color}.У неё ${number} лапы.она любить ${string}`);
// let name = "cholpon";
// let age = "17";
// let citi = "Bishkek";
// let read = "book";
// console.log(`Я живу в ${citi}.Моё хобби  читать ${read}`);







