//FANTIONS
// Declorattion  function sayHello () {}  функцияга чейин чакыра алабыз,лод жфзганга сунушталбайт,кийин ошотбкадар чыгышы мүмкүн,бирок колдонсо болот
// EXPRESSION CINST SAYHELLO= function(){} функцияга чейин чакыра албайбыз,бул күчтүүрөк
// AROW FUNCITION CONST SAYHELLO=()=>{} функциянын кфскараак жазуу формуласы

// argument
// paremetr

// function great(name){
//     return console.log(name );

// }
// great("Aibek");

// if() {}

// function esepte(a) {
//     return console.log(a % 2 === 0 ? "Asan" : "Uson");
// }
// esepte(13);

// function myName(a) {
//     if (a >= 18) {
//         return console.log("Razrishon");
//     }else{
//         return console.log(" Ne Razrishon");
//     }

// }

// myName(18);

// const abdulla =(a) => {
//     return console.log(`Asan ${a}`);
// };

// abdulla("Kosh keldig");

// const aigul=function(c,a){
//     return console.log((200+a)/c);

// }

// aigul(10,50);

// function guldana(name,status){
//     return console.log(`${name} is a ${status}`);

// }

// guldana("Guldana","teacher" );
// guldana("Guldana", "student");
// guldana("Guldana", "mother");
// guldana("Guldana", "baby");
// guldana("Guldana", "girl");

// 1. Проверка числа на четность
// Задача: Напишите функцию, которая принимает число и возвращает, является ли оно четным, используя тернарный оператор.
// const anukta=(a)=>{

//     return console.log((a % 2===0 ? "chotkui" : "ne chotkui"));

// }
// anukta(23)

// 2. Сравнение двух чисел
// Задача: Напишите функцию, которая принимает два числа и возвращает большее из них с помощью тернарного оператора.
// function maxNumber(a, b) {
//   return console.log(a > b ? a : b);
// }
// maxNumber(124,1004)

// 3. Проверка длины строки
// Задача: Напишите функцию, которая принимает строку и проверяет, длиннее ли она 5 символов, используя тернарный оператор.
// function lengthofNext(){
//     return console.log(name.lenght>=5 ? "da" : "net");

// }

// 4. Возвращение положительного числа
// Задача: Напишите функцию, которая принимает число и возвращает его, если оно положительное, иначе возвращает 0.
// function start(b){
//     return console.log(b<=0 ? 0 : b);

// }

// start(12)

// 5. Проверка возраста на совершеннолетие
// Задача: Напишите функцию, которая принимает возраст и возвращает "Совершеннолетний" или "Несовершеннолетний" в зависимости от значения.
// function hello(a){
//     return console.log(a < 18 ? "Несовершеннолетний" : "Совершеннолетний");

// }
// hello(13)

// 6. Определение, является ли число нулём
// Задача: Напишите функцию, которая принимает число и возвращает "Ноль", если это 0, или само число в противном случае.

// function nol(b){
//     return console.log(b===0 ? 0 : b);

// }
// nol(0)

// 7. Проверка на отрицательное число
// Задача: Напишите функцию, которая принимает число и возвращает сообщение, является ли число отрицательным, используя тернарный оператор.
// function num(can){
//     return console.log(can<0 ? " ne otrisatelnyi" : " itrisateknyi ");

// }
// num(-5)
// num(3)

// 8. Преобразование строки в заглавные буквы (если она больше 3 символов)
// Задача: Напишите функцию, которая принимает строку и преобразует её в заглавные буквы, если её длина больше 3 символов.
// function me(d){
//     console.log(d.length >= 3 ? d.toUpperCase() : d);
// }

// me("Nurasul");
// me("bek");

// 9. Проверка на кратность числа
// Задача: Напишите функцию, которая принимает два числа: число и делитель, и возвращает, делится ли число на делитель без остатка.
// function sun(number,divisor){
//     return console.log(number % divisor);

// }
// sun(12,3);
// sun(12,5);

// 1. Возрастное ограничение
// Попроси пользователя ввести его возраст. Если возраст меньше 18, выведи сообщение "Доступ запрещен". Если возраст больше или равен 18, выведи "Доступ разрешен".
// const age = function (a) {
//     console.log(a);
    
//   return console.log(a > 18 ? "Доступ разрищон" : "Доступ заприщон");
// };
// age(52);

// 2. Оценка успеваемости
// Попроси пользователя ввести его баллы за экзамен (от 0 до 100). Если баллы больше или равны 90, выведи "Отлично", если от 70 до 89 — "Хорошо", если от 50 до 69 — "Удовлетворительно". Если баллы меньше 50 — "Неудовлетворительно".

// function check(a){

// if(a>=90){
//     return console.log("Отлично");
    
// }else if(a>70 && a<=89){
//     return console.log("Хорошо");
    
// }else if(a>=50 && a<=69){
//     return console.log("Удовлетворительно");

// }else if(a>=50){
//     return console.log("Неудовлетворительно");

// }


//  }

// check(70)




// 3. Проверка времени суток
// Попроси пользователя ввести час (от 0 до 23). Если время от 0 до 11 — выведи "Доброе утро", от 12 до 17 — "Добрый день", от 18 до 23 — "Добрый вечер".

// let hour= prompt("ВВидиде час");
// if(hour<=11) {
//     console.log("Доброе утро");
// }else if(hour<=17){
//     console.log("Добрый день");
// }else if (hour<=23){
//     console.log("Добрый");
// }

// 4. Проверка на кратность
// Пользователь вводит число. Нужно проверить, кратно ли оно 3 или 5. Если кратно 3 — вывести "Число кратно 3", если кратно 5 — "Число кратно 5". Если кратно и 3, и 5 — "Число кратно 3 и 5". Если не кратно — "Число не кратно ни 3, ни 5".


// 5. Проверка пароля
// Пользователь вводит пароль. Если пароль равен "admin123", вывести сообщение "Доступ разрешен", иначе — "Неверный пароль".
