// let a = 10;
// let b = 2;
// let c = 5;
// console.log(a + b + c);

// let number = -1389.34;




//​Math.abs(a) — Оң мааниси (Модуль)
// ​Math.ceil(a) — Өйдө карай тегеректөө
// ​Math.floor(a) — Төмөн карай тегеректөө
// ​Math.max(a, b) — Эң чоңун табуу
// ​Math.min(a, b) — Эң кичинесин табуу
// ​Math.pow(a, b) — Даражага көтөрүү
// ​Math.random() — Кокус сан тандоо
// ​Math.round(a) — Жөнөкөй тегеректөө
// ​Math.sqrt(a) — Квадраттык тамыр
// ​Math.trunc(a) — Бөлчөгүн кыркып салуу
// көбөйтүү a * b  ушундай кылабыз
// % остаток калтырганда а % b  кылабыз
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.

//3.
// let a = 100;
// let b = 2;
// console.log(a * b);

//4
// let a= 67;
// let b = 7;
// console.log(a % b);


//5

// let a = 10;
// let b = 2;
// console.log(a==b);

//6

// let c =15;
// let d =2;
// let result=  c + d;
// console.log(result );

//7

// let a =30;
// let b =15;
// let c = 45;
// console.log(c % 4);

//8

// let a = 17;
// let b = 10;
// let c = a-b;
// let d = 9;
// let result= c+d;
// console.log(result);






